<template>
  <div>
    <div><button @click="addFavorite(2)">{{ fava }}</button></div>
    <h1>{{ news[1].text }}</h1>
   <div>
     <p class="news-style">Много лет существовали две версии Хабра: десктопная и мобильная.
    Они использовали разный стек технологий, поэтому на разработку каждой новой фичи мы тратили вдвое больше времени.
    К тому же десктопная версия давно устарела, что добавляло ещё больше проблем.
    Десктопную версию писали, без преувеличения, несколько поколений разработчиков, поэтому некоторые из используемых технологий успели окончательно устареть.
    Последние несколько лет каждая новая фича становилась верхушкой айсберга рефакторинга и копаний в legacy-коде.
       В конечном счёте мы устали от этого «монстра» и решили победить его.</p>
    <img src="../assets/habr.png" height="60%" width="60%"> <br>
    <p class="news-style">
      Чтобы ускорить процесс разработки и внедрения новых фич, мы решили оставить только одну версию сайта, мобильную.
      С прошлого года наша команда занималась наращиванием её функциональности.
      Была проделана колоссальная по объёму работа, многое было написано фактически с нуля.
    </p>
    <p class="news-style">
      В результате наших трудов мобильная версия по функциональности догнала десктопную и теперь на любых устройствах пользователи могут видеть одну и ту же версию с одним интерфейсом.
      Но это неточно — возможно, какие-то огрехи всё же есть.
      Это и хочется коллективно проверить.
    </p>
    <p class="news-style">
      В рамках тестирования мы предлагаем пользователям отключить старую десктопную версию Хабра и воспользоваться новой платформой.
    </p>
    Больше информации по ссылке
    <a style="color:black;" href="https://habr.com/ru/company/habr/blog/552384/">Открытый бета-тест новой версии Хабра</a>
   </div>
    <div class="return"><router-link to="/" class="return">Главная</router-link></div>
  </div>
</template>

<script>
import { mapGetters, mapMutations } from 'vuex'

export default {
  name: 'news3',
  data () {
    return {
    }
  },
  methods: {
    ...mapMutations({
      addFavorite: 'addFavorite'
    })
  },
  computed: {
    ...mapGetters({
      news: 'NEWS',
      show: 'SHOW2'
    }),
    fava () {
      if (this.show === true) {
        return 'Удалить из избранного'
      } return 'Добавить в избранное'
    }
  }
}
</script>

<style scoped>

</style>
